{
  "metadata": {
    "title": "Forward Contract Management in ERPNext | Currency Hedging Module - Finbyz Tech",
    "description": "",
    "keywords": []
  },
  "sections": [
    {
      "type": "hero",
      "component_type": "Hero",
      "id": "hero-forward-contract-app",
      "data": {
        "title": "Forward Contract App",
        "subtitle": "Manage your forward contracts with ease and hedge against currency risk.",
        "image": {
          "src": "/images/forward-contract-hero.jpg",
          "alt": "Forward Contract App Illustration"
        }
      }
    },
    {
      "type": "intro-text",
      "component_type": "Text",
      "id": "intro-forward-contract",
      "data": {
        "title": "Forward Contract Overview",
        "paragraphs": [
          "Forward contracting is a financial tool used to hedge foreign exchange risk by locking in a fixed exchange rate for a future transaction. It involves an agreement between two parties to buy or sell an asset at a predetermined price and date. Forward contracts are commonly used by importers and exporters to manage their exposure to currency fluctuations."
        ]
      }
    },
    {
      "type": "content-with-illustration-left",
      "component_type": "Card",
      "id": "content-introduction",
      "data": {
        "title": "Introduction",
        "bullets": [
          "Forward contract is used for hedging the foreign exchange risk for future settlement. For example, An importer or exporter having FX contract limit may lock in current exchange rate by entering into forward contract with the bank to avoid adverse rate movement.",
          "The essential idea of entering into a forward contract is to fix the exchange rate in advance and thereby avoid the exchange rate risk. Forward Rates = spot rate +/- premium/discount.",
          "This custom application works seamlessly with ERPNext to allow you manage your forward contracts."
        ],
        "image": {
          "src": "/images/forward-contract-intro.jpg",
          "alt": "Introduction to Forward Contract"
        },
        "video": {
          "src": "https://www.youtube.com/embed/iFIIVCgj_Zc",
          "title": "YouTube video player"
        }
      }
    },
    {
      "type": "benefits",
      "component_type": "Card",
      "id": "benefits-create-forward-contract",
      "data": {
        "title": "How to create Forward Contracts:",
        "steps": [
          "Go to Forward Contract List, Click on Add Forward Contract",
          "Add Booking Reference Number which is given by Bank",
          "Select its Hedge for Export or Import",
          "Select Contract Currency",
          "Add contract amount",
          "Add current rate and premium. You can also add spread / margin that bank charges",
          "Add Booking Rate and Booking Date",
          "Choose Bank where forward has been booked in Bank field",
          "Select Maturity Date (is contract Start date) and Maturity To (Is contract end date)",
          "Click on save and submit"
        ],
        "image": {
          "src": "/files/fwd-cnt-14-to-23.gif",
          "alt": "Screen showing Forward Contract Creation"
        }
      }
    },
    {
      "type": "benefits",
      "component_type": "Card",
      "id": "benefits-utilize-forward-contract",
      "data": {
        "title": "How to utilize Forward Contracts:",
        "paragraphs": [
          "Forward Contract can utilized at the time of the payment received or made. In this case multi currency transaction will be processed at the forward contract rate.",
          "The outstanding forward contract amount will be reduced by the utilized amount. To do utilization of forward contract:"
        ],
        "steps": [
          "Go to the Payment Entry list and click on New",
          "Select the Party Type and the respective Customer/Supplier",
          "Select the Bank Account/Cash Account Paid to and Paid From. If it’s a multi currency transaction a new section for forward contract will appear",
          "Select the forward Contract in Forward Utilization table and Enter the Amount utilized",
          "Note you can utilize partial forward contract amount and/or can utilize multiple forward contracts for single payment",
          "Enter the Amount Paid",
          "Enter the bank reference and date if bank transfer",
          "Save and submit"
        ],
        "image": {
          "src": "/files/fwd-cnt-42-to-52.gif",
          "alt": "Screen showing Forward Contract Utilization"
        }
      }
    },
    {
      "type": "benefits",
      "component_type": "Card",
      "id": "benefits-cancel-forward-contract",
      "data": {
        "title": "How to Cancel Forward Contracts:",
        "paragraphs": [
          "If for any reason the forward contracts couldn’t be utilized till maturity, or for any other reason you decided to close the forward contract with bank. You need perform forward contract cancellation. This will reduce the outstanding amount of forward contract by cancelled amount, and park the gain or loss in cancellation of contract in respective profit and loss account. To do this:"
        ],
        "steps": [
          "Go to Forward Contract List, Open the forward contract you wish to cancel",
          "In Cancellation Section, Enter Cancellation date, Cancellation Amount, Cancellation rate and select the bank account where gain or loss will be credited",
          "Click on button add Cancellation details. This will add cancellation detail in table below and pass Journal entry for exchange rate gain/loss"
        ],
        "image": {
          "src": "/files/fwd-cnt-1.21-to-1.32.gif",
          "alt": "Screen showing Forward Contract Cancellation"
        }
      }
    }
  ]
}